{
  "format": "layers-model",
  "generatedBy": "Colab (manual TFJS export)",
  "convertedBy": "manual",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sentiment_bow",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                64
              ],
              "dtype": "float32",
              "name": "input"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            64,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}